app/views/courses/show.html.erb

SELECT AVG("ratings"."value") FROM "ratings" WHERE "ratings"."course_id" = ?  [["course_id", 3]]
---
    <h2>Course Rating</h2>
    <p><%= @course.ratings.average(:value) %></p>

SELECT "comments".* FROM "comments" WHERE "comments"."course_id" = ?  [["course_id", 3]]
---
    <div class="comment-count">
      <span class="comment-count__number"><%= @course.comments.count %></span>