app/controllers/comments_controller.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "body"], ["user_id", 1], ["course_id", 3], ["created_at", 2017-01-05 16:02:09 UTC], ["updated_at", 2017-01-05 16:02:09 UTC]]
---
  def create
    @course = Course.find(params[:course_id])
	  @comment = @course.comments.create(body: params[:comment][:body], course_id: :course_id, user_id: current_user.id)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."course_id" = ? AND "comments"."id" = ? LIMIT ?  [["course_id", 3], ["id", 3], ["LIMIT", 1]]
---
  def edit
  	@course = Course.find(params[:course_id])
  	@comment = @course.comments.find(params[:id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", nil], ["updated_at", 2017-01-05 22:30:23 UTC], ["id", 1]]
---
  def update
  	@course = Course.find(params[:course_id])
  	@comment = Comment.find(params[:id])
  	@comment.body = params[:comment][:body]
  	if @comment.save