app/controllers/courses_controller.rb

INSERT INTO "courses" ("code", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["code", "1"], ["description", "1"], ["created_at", 2016-12-18 21:27:12 UTC], ["updated_at", 2016-12-18 21:27:12 UTC]]
---
	def create
		@course = Course.new(course_params)

		if @course.save

SELECT "courses".* FROM "courses"
---
	def fetch
		@courses = Course.all