app/controllers/ratings_controller.rb

  def create #TODO
    @course = Course.find(params[:course_id])
    @rating = @course.ratings.find_by(user_id: current_user.id, rating_type: params[:rating][:rating_type])
    #@rating = Rating.find_by(course_id: :course_id, user_id: current_user.id)
    if @rating.nil?
    	@rating=@course.ratings.create(value: params[:rating][:value], course_id: :course_id, user_id: current_user.id)
    else
    	@rating.value=params[:rating][:value]
	  end

	  if @rating.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ? AND "ratings"."course_id" = ? LIMIT ?  [["user_id", 1], ["course_id", nil], ["LIMIT", 1]]
INSERT INTO "ratings" ("user_id", "course_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["course_id", 3], ["value", 1], ["created_at", 2017-01-05 22:36:27 UTC], ["updated_at", 2017-01-05 22:36:27 UTC]]
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."course_id" = ? LIMIT ?  [["course_id", nil], ["LIMIT", 1]]
UPDATE "ratings" SET "value" = ?, "updated_at" = ? WHERE "ratings"."id" = ?  [["value", 3], ["updated_at", 2017-01-05 22:49:09 UTC], ["id", 1]]